mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>LFSS_STA</name>
                    <description>RTC Status Register</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RTCRDY</name>
                            <description>Real-time clock ready. This bit indicates when the real-time clock time values are safe for reading.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOT_READY</name>
                                        <description>RTC time values in transition</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READY</name>
                                        <description>RTC time values safe for reading.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RTCTCRDY</name>
                            <description>Real-time clock temperature compensation ready. This is a read only bit that indicates when the RTCTCMPx can be written. Write to RTCTCMPx should be avoided when RTCTCRDY is reset.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOT_READY</name>
                                        <description>RTC temperature compensation in transition</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READY</name>
                                        <description>RTC temperature compensation ready</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RTCTCOK</name>
                            <description>Real-time clock temperature compensation write OK. This is a read-only bit that indicates if the write to RTCTCMP is successful or not.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOT_OK</name>
                                        <description>Write to RTCTCMPx is unsuccessful</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OK</name>
                                        <description>Write to RTCTCMPx is successful</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_CAL</name>
                    <description>RTC Clock Offset Calibration Register</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RTCOCALX</name>
                            <description>Real-time clock offset error calibration. Each LSB represents approximately +1ppm (RTCOCALXS = 1) or -1ppm (RTCOCALXS = 0) adjustment in frequency. Maximum effective calibration value is +/-240ppm. Excess values written above +/-240ppm will be ignored by hardware.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>RTCOCALS</name>
                            <description>Real-time clock offset error calibration sign. This bit decides the sign of offset error calibration.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DOWN</name>
                                        <description>Down calibration. Frequency adjusted down.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UP</name>
                                        <description>Up calibration. Frequency adjusted up.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RTCCALFX</name>
                            <description>Real-time clock calibration frequency. Selects frequency output to RTCCLK pin for calibration measurement. The corresponding port must be configured for the peripheral module function.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>F32KHZ</name>
                                        <description>32 kHz</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>F512HZ</name>
                                        <description>512 Hz</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>F256HZ</name>
                                        <description>256 Hz</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>F1HZ</name>
                                        <description>1 Hz</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_TCMP</name>
                    <description>RTC Temperature Compensation Register</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RTCTCMPX</name>
                            <description>Real-time clock temperature compensation. Value written into this register is used for temperature compensation of RTC. Each LSB represents approximately +1ppm (RTCTCMPS = 1) or -1ppm (RTCTCMPS = 0) adjustment in frequency. Maximum effective calibration value is +/-240ppm. Excess values written above +/-240ppm are ignored by hardware. Reading from RTCTCMP register at any time returns the cumulative value which is the signed addition of RTCOCALx and RTCTCMPX values, and the updated sign bit (RTCTCMPS) of the addition result.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>RTCTCMPS</name>
                            <description>Real-time clock temperature compensation sign. This bit decides the sign of temperature compensation.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DOWN</name>
                                        <description>Down calibration. Frequency adjusted down.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UP</name>
                                        <description>Up calibration. Frequency adjusted up.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_SEC</name>
                    <description>RTC Seconds Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffff80c0</resetMask>
                    <fields>
                        <field>
                            <name>SECBIN</name>
                            <description>Seconds Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>SECLOWBCD</name>
                            <description>Seconds BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>SECHIGHBCD</name>
                            <description>Seconds BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_MIN</name>
                    <description>RTC Minutes Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x111C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffff80c0</resetMask>
                    <fields>
                        <field>
                            <name>MINBIN</name>
                            <description>Minutes Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>MINLOWBCD</name>
                            <description>Minutes BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>MINHIGHBCD</name>
                            <description>Minutes BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_HOUR</name>
                    <description>RTC Hours Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffc0e0</resetMask>
                    <fields>
                        <field>
                            <name>HOURBIN</name>
                            <description>Hours Binary (0 to 23). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>HOURLOWBCD</name>
                            <description>Hours BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>HOURHIGHBCD</name>
                            <description>Hours BCD  high digit (0 to 2). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_DAY</name>
                    <description>RTC Day Of Week / Month Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffc0e0f8</resetMask>
                    <fields>
                        <field>
                            <name>DOW</name>
                            <description>Day of week (0 to 6). These bits are valid if RTCBCD=1 or RTCBCD=0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>DOMBIN</name>
                            <description>Day of month Binary (1 to 28, 29, 30, 31). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>DOMLOWBCD</name>
                            <description>Day of month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>DOMHIGHBCD</name>
                            <description>Day of month BCD  high digit (0 to 3). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_MON</name>
                    <description>RTC Month Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x1128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffe0f0</resetMask>
                    <fields>
                        <field>
                            <name>MONBIN</name>
                            <description>Month Binary (1 to 12). If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>MONLOWBCD</name>
                            <description>Month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>MONHIGHBCD</name>
                            <description>Month BCD  high digit (0 or 1). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>LFSS_YEAR</name>
                    <description>RTC Year Register - Calendar Mode With Binary / BCD Format</description>
                    <addressOffset>0x112C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x8000f000</resetMask>
                    <fields>
                        <field>
                            <name>YEARLOWBIN</name>
                            <description>Year Binary  low byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>YEARHIGHBIN</name>
                            <description>Year Binary  high byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>YEARLOWESTBCD</name>
                            <description>Year BCD  lowest digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>DECADEBCD</name>
                            <description>Decade BCD (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>CENTLOWBCD</name>
                            <description>Century BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>CENTHIGHBCD</name>
                            <description>Century BCD  high digit (0 to 4). If RTCBCD=0 write to these bits will be ignored and read give the value 0.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
