mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>GPIOA_FILTEREN15_0</name>
                    <description>Filter Enable 15 to 0</description>
                    <addressOffset>0x1508</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN0</name>
                            <description>Programmable counter length of digital glitch filter for DIN0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN1</name>
                            <description>Programmable counter length of digital glitch filter for DIN1</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN2</name>
                            <description>Programmable counter length of digital glitch filter for DIN2</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN3</name>
                            <description>Programmable counter length of digital glitch filter for DIN3</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN4</name>
                            <description>Programmable counter length of digital glitch filter for DIN4</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN5</name>
                            <description>Programmable counter length of digital glitch filter for DIN5</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN6</name>
                            <description>Programmable counter length of digital glitch filter for DIN6</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN7</name>
                            <description>Programmable counter length of digital glitch filter for DIN7</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN8</name>
                            <description>Programmable counter length of digital glitch filter for DIN8</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN9</name>
                            <description>Programmable counter length of digital glitch filter for DIN9</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN10</name>
                            <description>Programmable counter length of digital glitch filter for DIN10</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN11</name>
                            <description>Programmable counter length of digital glitch filter for DIN11</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN12</name>
                            <description>Programmable counter length of digital glitch filter for DIN12</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE_CYCLE</name>
                                        <description>1 ULPCLK minimum sample</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>THREE_CYCLE</name>
                                        <description>3 ULPCLK minimum sample</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EIGHT_CYCLE</name>
                                        <description>8 ULPCLK minimum sample</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DIN13</name>
                            <description>Programmable counter length of digital glitch filter for DIN13</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>No additional filter beyond the CDC synchronization sample</description>
                                        <value>0x0</value>
