mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>SYSCTL_SYSOSCCFG</name>
                    <description>SYSOSC configuration</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00020000</resetValue>
                    <resetMask>0x00030703</resetMask>
                    <fields>
                        <field>
                            <name>USE4MHZSTOP</name>
                            <description>USE4MHZSTOP sets the SYSOSC stop mode frequency policy.  When entering STOP mode, the SYSOSC frequency may be automatically switched to 4MHz to reduce SYSOSC power consumption.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Do not gear shift the SYSOSC to 4MHz in STOP mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Gear shift SYSOSC to 4MHz in STOP mode</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DISABLESTOP</name>
                            <description>DISABLESTOP sets the SYSOSC stop mode enable/disable policy.  When operating in STOP mode, the SYSOSC may be automatically disabled.  When set, ULPCLK will run from LFCLK in STOP mode and SYSOSC will be disabled to reduce power consumption.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Do not disable SYSOSC in STOP mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Disable SYSOSC in STOP mode and source ULPCLK from LFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>BLOCKASYNCALL</name>
                            <description>BLOCKASYNCALL may be used to mask block all asynchronous fast clock requests, preventing hardware from dynamically changing the active clock configuration when operating in a given mode.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Asynchronous fast clock requests are controlled by the requesting peripheral</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>All asynchronous fast clock requests are blocked</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DISABLE</name>
                            <description>DISABLE sets the SYSOSC enable/disable policy.  SYSOSC may be powered off in RUN, SLEEP, and STOP modes to reduce power consumption.  When SYSOSC is disabled, MCLK and ULPCLK are sourced from LFCLK.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Do not disable SYSOSC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Disable SYSOSC immediately and source MCLK and ULPCLK from LFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FASTCPUEVENT</name>
                            <description>FASTCPUEVENT may be used to assert a fast clock request when an interrupt is asserted to the CPU, reducing interrupt latency.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>An interrupt to the CPU will not assert a fast clock request</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt to the CPU will assert a fast clock request</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FREQ</name>
                            <description>Target operating frequency for the system oscillator (SYSOSC)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSCBASE</name>
                                        <description>Base frequency (32MHz)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSC4M</name>
                                        <description>Low frequency (4MHz)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SYSOSCUSER</name>
                                        <description>User-trimmed frequency (16 or 24 MHz)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_MCLKCFG</name>
                    <description>Main clock (MCLK) configuration</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000210</resetValue>
                    <resetMask>0x00711f3f</resetMask>
                    <fields>
                        <field>
                            <name>USEMFTICK</name>
                            <description>USEMFTICK specifies whether the 4MHz constant-rate clock (MFCLK) to peripherals is enabled or disabled.  When enabled, MDIV must be disabled (set to 0h=/1).</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The 4MHz rate MFCLK to peripherals is enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The 4MHz rate MFCLK to peripherals is enabled.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MDIV</name>
                            <description>MDIV may be used to divide the MCLK frequency when MCLK is sourced from SYSOSC.  MDIV=0h corresponds to /1 (no divider).  MDIV=1h corresponds to /2 (divide-by-2).  MDIV=Fh corresponds to /16 (divide-by-16).  MDIV may be set between /1 and /16 on an integer basis.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>USEHSCLK</name>
                            <description>USEHSCLK, together with USELFCLK, sets the MCLK source policy.  Set USEHSCLK to use HSCLK (HFCLK or SYSPLL) as the MCLK source in RUN and SLEEP modes.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>MCLK will not use the high speed clock (HSCLK)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>MCLK will use the high speed clock (HSCLK) in RUN and SLEEP mode</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>USELFCLK</name>
                            <description>USELFCLK sets the MCLK source policy.  Set USELFCLK to use LFCLK as the MCLK source.  Note that setting USELFCLK does not disable SYSOSC, and SYSOSC remains available for direct use by analog modules.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>MCLK will not use the low frequency clock (LFCLK)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>MCLK will use the low frequency clock (LFCLK)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STOPCLKSTBY</name>
                            <description>STOPCLKSTBY sets the STANDBY mode policy (STANDBY0 or STANDBY1).  When set, ULPCLK and LFCLK are disabled to all peripherals in STANDBY mode, with the exception of TIMG0 and TIMG1 which continue to run.  Wake-up is only possible via an asynchronous fast clock request.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>ULPCLK/LFCLK runs to all PD0 peripherals in STANDBY mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>ULPCLK/LFCLK is disabled to all peripherals in STANDBY mode except TIMG0 and TIMG1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>FLASHWAIT</name>
                            <description>FLASHWAIT specifies the number of flash wait states when MCLK is sourced from HSCLK.  FLASHWAIT has no effect when MCLK is sourced from SYSOSC or LFCLK.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>WAIT0</name>
                                        <description>No flash wait states are applied</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>WAIT1</name>
                                        <description>One flash wait state is applied</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>WAIT2</name>
                                        <description>2 flash wait states are applied</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MCLKDEADCHK</name>
                            <description>MCLKDEADCHK enables or disables the continuous MCLK dead check monitor.  LFCLK must be running before MCLKDEADCHK is enabled.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The MCLK dead check monitor is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The MCLK dead check monitor is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>UDIV</name>
                            <description>UDIV specifies the ULPCLK divider when MCLK is sourced from HSCLK.  UDIV has no effect when MCLK is sourced from SYSOSC or LFCLK.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NODIVIDE</name>
                                        <description>ULPCLK is not divided and is equal to MCLK</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DIVIDE2</name>
                                        <description>ULPCLK is MCLK/2 (divided-by-2)</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_HSCLKEN</name>
                    <description>High-speed clock (HSCLK) source enable/disable</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00010101</resetMask>
                    <fields>
                        <field>
                            <name>HFXTEN</name>
                            <description>HFXTEN enables or disables the high frequency crystal oscillator (HFXT).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable the HFXT</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable the HFXT</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>USEEXTHFCLK</name>
                            <description>USEEXTHFCLK selects the HFCLK_IN digital clock input to be the source for HFCLK.  When disabled, HFXT is the HFCLK source and HFXTEN may be set.  Do not set HFXTEN and USEEXTHFCLK simultaneously.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Use HFXT as the HFCLK source</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Use the HFCLK_IN digital clock input as the HFCLK source</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SYSPLLEN</name>
                            <description>SYSPLLEN enables or disables the system phase-lock loop (SYSPLL).</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable the SYSPLL</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable the SYSPLL</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
