mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>SYSCTL_SYSPLLCFG0</name>
                    <description>SYSPLL reference and output configuration</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fff73</resetMask>
                    <fields>
                        <field>
                            <name>ENABLECLK0</name>
                            <description>ENABLECLK0 enables or disables the SYSPLLCLK0 output.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SYSPLLCLK0 is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SYSPLLCLK0 is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENABLECLK1</name>
                            <description>ENABLECLK1 enables or disables the SYSPLLCLK1 output.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SYSPLLCLK1 is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SYSPLLCLK1 is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RDIVCLK1</name>
                            <description>RDIVCLK1 sets the final divider for the SYSPLLCLK1 output.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLK1DIV2</name>
                                        <description>SYSPLLCLK1 is divided by 2</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV4</name>
                                        <description>SYSPLLCLK1 is divided by 4</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV6</name>
                                        <description>SYSPLLCLK1 is divided by 6</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV8</name>
                                        <description>SYSPLLCLK1 is divided by 8</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV10</name>
                                        <description>SYSPLLCLK1 is divided by 10</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV12</name>
                                        <description>SYSPLLCLK1 is divided by 12</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV14</name>
                                        <description>SYSPLLCLK1 is divided by 14</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV16</name>
                                        <description>SYSPLLCLK1 is divided by 16</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV18</name>
                                        <description>SYSPLLCLK1 is divided by 18</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV20</name>
                                        <description>SYSPLLCLK1 is divided by 20</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV22</name>
                                        <description>SYSPLLCLK1 is divided by 22</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV24</name>
                                        <description>SYSPLLCLK1 is divided by 24</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV26</name>
                                        <description>SYSPLLCLK1 is divided by 26</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV28</name>
                                        <description>SYSPLLCLK1 is divided by 28</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV30</name>
                                        <description>SYSPLLCLK1 is divided by 30</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK1DIV32</name>
                                        <description>SYSPLLCLK1 is divided by 32</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>MCLK2XVCO</name>
                            <description>MCLK2XVCO selects the SYSPLL output which is sent to the HSCLK mux for use by MCLK.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The SYSPLLCLK0 output is sent to the HSCLK mux</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>The SYSPLLCLK2X output is sent to the HSCLK mux</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RDIVCLK2X</name>
                            <description>RDIVCLK2X sets the final divider for the SYSPLLCLK2X output.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLK2XDIV1</name>
                                        <description>SYSPLLCLK1 is divided by 1</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV2</name>
                                        <description>SYSPLLCLK1 is divided by 2</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV3</name>
                                        <description>SYSPLLCLK1 is divided by 3</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV4</name>
                                        <description>SYSPLLCLK1 is divided by 4</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV5</name>
                                        <description>SYSPLLCLK1 is divided by 5</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV6</name>
                                        <description>SYSPLLCLK1 is divided by 6</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV7</name>
                                        <description>SYSPLLCLK1 is divided by 7</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV8</name>
                                        <description>SYSPLLCLK1 is divided by 8</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV9</name>
                                        <description>SYSPLLCLK1 is divided by 9</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV10</name>
                                        <description>SYSPLLCLK1 is divided by 10</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV11</name>
                                        <description>SYSPLLCLK1 is divided by 11</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV12</name>
                                        <description>SYSPLLCLK1 is divided by 12</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV13</name>
                                        <description>SYSPLLCLK1 is divided by 13</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV14</name>
                                        <description>SYSPLLCLK1 is divided by 14</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV15</name>
                                        <description>SYSPLLCLK1 is divided by 15</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK2XDIV16</name>
                                        <description>SYSPLLCLK1 is divided by 16</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RDIVCLK0</name>
                            <description>RDIVCLK0 sets the final divider for the SYSPLLCLK0 output.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLK0DIV2</name>
                                        <description>SYSPLLCLK0 is divided by 2</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV4</name>
                                        <description>SYSPLLCLK0 is divided by 4</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV6</name>
                                        <description>SYSPLLCLK0 is divided by 6</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV8</name>
                                        <description>SYSPLLCLK0 is divided by 8</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV10</name>
                                        <description>SYSPLLCLK0 is divided by 10</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV12</name>
                                        <description>SYSPLLCLK0 is divided by 12</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV14</name>
                                        <description>SYSPLLCLK0 is divided by 14</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV16</name>
                                        <description>SYSPLLCLK0 is divided by 16</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV18</name>
                                        <description>SYSPLLCLK0 is divided by 18</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV20</name>
                                        <description>SYSPLLCLK0 is divided by 20</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV22</name>
                                        <description>SYSPLLCLK0 is divided by 22</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV24</name>
                                        <description>SYSPLLCLK0 is divided by 24</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV26</name>
                                        <description>SYSPLLCLK0 is divided by 26</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV28</name>
                                        <description>SYSPLLCLK0 is divided by 28</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV30</name>
                                        <description>SYSPLLCLK0 is divided by 30</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CLK0DIV32</name>
                                        <description>SYSPLLCLK0 is divided by 32</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SYSPLLREF</name>
                            <description>SYSPLLREF selects the system PLL (SYSPLL) reference clock source.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>SYSOSC</name>
                                        <description>SYSPLL reference is SYSOSC</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HFCLK</name>
                                        <description>SYSPLL reference is HFCLK</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENABLECLK2X</name>
                            <description>ENABLECLK2X enables or disables the SYSPLLCLK2X output.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>SYSPLLCLK2X is disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>SYSPLLCLK2X is enabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
