mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>FLASHCTL_BANK4INFO1</name>
                    <description>Bank Information Register 1 for Bank 4</description>
                    <addressOffset>0x1444</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NONMAINSIZE</name>
                            <description>Non-main region size in sectors</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [NONMAINSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [NONMAINSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIMSIZE</name>
                            <description>Trim region size in sectors</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [TRIMSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [TRIMSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENGRSIZE</name>
                            <description>Engr region size in sectors</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MINSECTORS</name>
                                        <description>Minimum value of [ENGRSIZE]</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXSECTORS</name>
                                        <description>Maximum value of [ENGRSIZE]</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>I2S0</name>
            <groupName>I2S</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x4047B000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1F00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>24</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>I2S0_GPRCM[%s]</name>
                    <description></description>
                    <addressOffset>0x800</addressOffset>
                    <register>
                        <name>I2S0_PWREN</name>
                        <description>Power enable</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>ENABLE</name>
                                <description>Enable the power</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable Power</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable Power</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2S0_RSTCTL</name>
                        <description>Reset Control</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>RESETSTKYCLR</name>
                                <description>Clear the RESETSTKY bit in the STAT register</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOP</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear reset sticky bit</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RESETASSERT</name>
                                <description>Assert reset to the peripheral</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOP</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ASSERT</name>
                                            <description>Assert reset</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2S0_CLKCFG</name>
                        <description>Peripheral Clock Configuration Register</description>
                        <addressOffset>0x8</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>DAICLK</name>
                                <description>Audio Clock</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>SYSOSC</name>
                                            <description>SYSOSC</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HFXT</name>
                                            <description>HF crystal</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>PLL</name>
                                            <description>PLL</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2S0_GPRCM_STAT</name>
                        <description>Status Register</description>
                        <addressOffset>0x14</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>RESETSTKY</name>
                                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NORES</name>
                                            <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RESET</name>
                                            <description>The peripheral was reset since the last bit clear</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <register>
                    <name>I2S0_PDBGCTL</name>
                    <description>Peripheral Debug Control</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <field>
                            <name>FREE</name>
                            <description>Free run control</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>STOP</name>
                                        <description>The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RUN</name>
                                        <description>The peripheral ignores the state of the Core Halted input</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SOFT</name>
                            <description>Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>IMMEDIATE</name>
                                        <description>The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DELAYED</name>
                                        <description>The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>I2S0_CPU_INT[%s]</name>
                    <description></description>
                    <addressOffset>0x1020</addressOffset>
                    <register>
                        <name>I2S0_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MIS registers. 15h-1Fh = Reserved</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No interrupt pending</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>WCLKERR</name>
                                            <description>WCLK Error</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RXIFG</name>
                                            <description>Receive interrupt; Interrupt Flag: RX</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TXIFG</name>
                                            <description>Transmit interrupt; Interrupt Flag: TX</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RXFIFO_OVF_EVT</name>
                                            <description>RX FIFO Overflow Event/interrupt pending</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TXFIFO_UNF_EVT</name>
                                            <description>TX FIFO underflow interrupt</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMA_DONE_RX</name>
                                            <description>DMA DONE on RX</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMA_DONE_TX</name>
                                            <description>DMA DONE on TX</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMA_PREIRQ_RX</name>
                                            <description>DMA PRE IRQ INTERRUPT</description>
                                            <value>0x13</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMA_PREIRQ_TX</name>
                                            <description>DMA PRE IRQ INTERRUPT</description>
                                            <value>0x14</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>I2S0_IMASK</name>
                        <description>Interrupt Mask Register

