mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
Note: When 0, MSB of the next word will be output in the idle period between LSB of the previous word and the start of the next word. Otherwise logical 0 will be output until the data delay has expired.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ZERO</name>
                                        <description>Zero BCLK periods - LJF and DSP formats</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ONE</name>
                                        <description>One BCLK periods - I2S and DSP formats</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TWO</name>
                                        <description>Two(Min) BCLK periods - RJF format</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAX</name>
                                        <description>Max(255) BCLK periods - RJF format</description>
                                        <value>0xFF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SUSPEND</name>
                            <description>Suspend external communication</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Functional mode resumed</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>External communication suspended</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENABLE</name>
                            <description>I2S Module Enable.  
    If the I2S is disabled in the middle of transmission or reception, it completes the current character before stopping. 
    If ENABLE bit is not set, all registers can still be accessed and updated. It is recommended to setup and change I2S operation mode whhile ENABLE bit is cleared to avoid unpredictable behavior during setup or update.
    If disabled,  I2S module will not send or receive any data.</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable Module</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable module</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EMPTYSLOTOUTPUT</name>
                            <description>The field configures the EMPTYSLOTOUTPUT data pin direction</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>zero</name>
                                        <description>Send out zeroes in empty slots</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>one</name>
                                        <description>send out ones in empty slot</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>Tristate</name>
                                        <description>Tristate line during empty slot</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>I2S0_CLKCTL</name>
                    <description>This register controls internal audio clock</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WBEN</name>
                            <description>This field configures WCLK/BCLK generation</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disables the generation</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EN</name>
                                        <description>Enable the generation</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>WCLKPHASE</name>
                            <description>The field configures how the WCLK division ratio is calculated and used to generate different duty cycles (See [WCLKDIV.WDIV])</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>MEN</name>
                            <description>This field configures the MCLK generation</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disable the generation</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EN</name>
                                        <description>Enable the generation</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>I2S0_STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>TXFF</name>
                            <description>Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The transmitter is not full.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXFF</name>
                            <description>Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The receiver can receive data.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The transmitter has data to transmit.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>If the FIFO is disabled (FEN is 0), the transmit holding register is empty. If the FIFO is enabled (FEN is 1), the transmit FIFO is empty.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXFE</name>
                            <description>Receive FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The receiver is not empty.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>If the FIFO is disabled (FEN is 0), the receive holding register is empty. If the FIFO is enabled (FEN is 1), the receive FIFO is empty.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXCLR</name>
                            <description>RX FIFO Clear Status</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>FIFO is not cleared</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>FIFO clear is complete</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXCLR</name>
                            <description>TX FIFO Clear Status</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>FIFO is not cleared</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>FIFO clear is complete</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>I2S0_IFLS</name>
                    <description>Interrupt FIFO Level Select Register</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000022</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TXIFLSEL</name>
                            <description>FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LVL_3_4</name>
                                        <description>TX FIFO &lt;= 3/4 empty</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_2</name>
                                        <description>TX FIFO &lt;= 1/2 empty (default)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_4</name>
                                        <description>TX FIFO &lt;= 1/4 empty</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_EMPTY</name>
                                        <description>TX FIFO is empty</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_EMPTY</name>
                                        <description>TX FIFO &lt;= 1</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_FULL</name>
                                        <description>TX_FIFO &gt;= (MAX_FIFO_LEN -1)</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXIFLSEL</name>
                            <description>Receive Interrupt FIFO Level Select  The trigger points for the receive interrupt are as follows: 

