mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>NPU_CTL5</name>
                    <description>CTL5 register</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RUN</name>
                            <description>Start the accelerator. Writing a 1 to this bit starts the accelerator. When the STOP instruction is executed this bit is cleared by hardware and DONE interrupt flag is set.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>ENIFMAPCIRC</name>
                            <description>Enable circular addressing on input feature map read address.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable circular buffering on the input feature map</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ENOFMAPCIRC</name>
                            <description>Enable circular addressing on output feature map read address.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable circular buffering on the output feature map</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable circular buffering on the output feature map</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>NPU_CTL4</name>
                    <description></description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>OFMAPCIRSTART</name>
                            <description>Circular buffer output feature map start address.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>OFMAPCIREND</name>
                            <description>Circular buffer output feature map end address.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>NPU_CTL3</name>
                    <description></description>
                    <addressOffset>0x1128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IFMAPCIRSTART</name>
                            <description>Circular buffer input feature map start address</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>IFMAPCIREND</name>
                            <description>Circular buffer input feature map end address</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>NPU_CTL2</name>
                    <description>CTL2 register</description>
                    <addressOffset>0x112C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CLLOW</name>
                            <description>Lower clamp value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x9</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>CLHIGH</name>
                            <description>Upper clamp value</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x9</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>NPU_CTL1</name>
                    <description>CTL1 register</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IFMAPSTARTHI</name>
                            <description>Start address (Higher 16 bits) of input feature map data.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>OFMAPSTARTHI</name>
                            <description>Start address (Higher 16 bits) of output feature map data.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>NPU_CTL0</name>
                    <description>CTL0 register</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>WTYPE</name>
                            <description>Weight Type</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>_2T</name>
                                        <description>+1,-1,0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BINARY</name>
                                        <description>Binary data type, +1 or -1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_2BIT</name>
                                        <description>Unsigned 8 bit data type</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_4BIT</name>
                                        <description>Signed 4 bit data type</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_8BIT</name>
                                        <description>Signed 8 bit data type</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>IFMAPTYPE</name>
                            <description>Input feature map type,</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNSIGNED_16BIT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UNSIGNED_8BIT</name>
                                        <description>Unsigned 8 bit data type</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UNSIGNED_4BIT</name>
                                        <description>Unsigned 4 bit data type</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BINARY</name>
                                        <description>Binary data type</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_16BIT</name>
                                        <description></description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_8BIT</name>
                                        <description>Signed 8 bit data type</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_4BIT</name>
                                        <description>Signed 4 bit data type</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>OFMAPTYPE</name>
                            <description>Output feature map type.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNSIGNED_16BIT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UNSIGNED_8BIT</name>
                                        <description>Unsigned 8 bit data type</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UNSIGNED_4BIT</name>
                                        <description>Unsigned 4 bit data type</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>BINARY</name>
                                        <description>Binary data type</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_16BIT</name>
                                        <description></description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_8BIT</name>
                                        <description>Signed 8 bit data type</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_4BIT</name>
                                        <description>Signed 4 bit data type</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>LAYERTYPE</name>
                            <description>Layer type</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FCONV</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DW</name>
                                        <description></description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PW</name>
                                        <description></description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CONV</name>
                                        <description></description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FC</name>
                                        <description></description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>AVGPOOL</name>
                                        <description></description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXPOOL</name>
                                        <description></description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FCONV_RESIDUAL</name>
                                        <description></description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DW_RESIDUAL</name>
                                        <description></description>
                                        <value>0x12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PW_RESIDUAL</name>
                                        <description></description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>CONV_RESIDUAL</name>
                                        <description></description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FC_RESIDUAL</name>
                                        <description></description>
                                        <value>0x16</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>AVGPOOL_RESIDUAL</name>
                                        <description></description>
                                        <value>0x17</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>MAXPOOL_RESIDUAL</name>
                                        <description></description>
                                        <value>0x18</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RESIFMAPTYPE</name>
                            <description>Residual Input feature map type,</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNSIGNED_16BIT</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UNSIGNED_8BIT</name>
                                        <description>Unsigned 8 bit data type</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>UNSIGNED_4BIT</name>
                                        <description>Unsigned 4 bit data type</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_16BIT</name>
                                        <description></description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_8BIT</name>
                                        <description>Signed 8 bit data type</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SIGNED_4BIT</name>
                                        <description>Signed 4 bit data type</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>24</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>NPU_LCREG[%s]</name>
                    <description></description>
                    <addressOffset>0x1138</addressOffset>
                    <register>
                        <dim>6</dim>
                        <dimIncrement>4</dimIncrement>
                        <dimArrayIndex>0,1,2,3,4,5</dimArrayIndex>
                        <name>NPU_LC[%s]</name>
                        <description>Loop count registers.</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CNT</name>
                                <description>Loop count.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x10</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
