mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                    <register>
                        <name>TIMB0_GEN_EVENT_ICLR</name>
                        <description>Interrupt clear. Write a 1 to clear corresponding Interrupt.</description>
                        <addressOffset>0x28</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>CNT0OVF</name>
                                <description>Clear Counter 0 period match flag.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT0STRT</name>
                                <description>Clear Counter 0 start event flag.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT0STOP</name>
                                <description>Clear Counter 0 stop event flag.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT1OVF</name>
                                <description>Clear Counter 1 period match flag.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT1STRT</name>
                                <description>Clear Counter 1 start event flag.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT1STOP</name>
                                <description>Clear Counter 1 stop event flag.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT2OVF</name>
                                <description>Clear Counter 2 period match flag.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT2STRT</name>
                                <description>Clear Counter 2 start event flag.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT2STOP</name>
                                <description>Clear Counter 2 stop event flag.</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT3OVF</name>
                                <description>Clear Counter 3 period match flag.</description>
                                <bitOffset>0x9</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT3STRT</name>
                                <description>Clear Counter 3 start event flag.</description>
                                <bitOffset>0xA</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT3STOP</name>
                                <description>Clear Counter 3 stop event flag.</description>
                                <bitOffset>0xB</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT4OVF</name>
                                <description>Clear Counter 4 period match flag.</description>
                                <bitOffset>0xC</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT4STRT</name>
                                <description>Clear Counter 4 start event flag.</description>
                                <bitOffset>0xD</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT4STOP</name>
                                <description>Clear Counter 4 stop event flag.</description>
                                <bitOffset>0xE</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT5OVF</name>
                                <description>Clear Counter 5 period match flag.</description>
                                <bitOffset>0xF</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT5STRT</name>
                                <description>Clear Counter 5 start event flag.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT5STOP</name>
                                <description>Clear Counter 5 stop event flag.</description>
                                <bitOffset>0x11</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT6OVF</name>
                                <description>Clear Counter 6 period match flag.</description>
                                <bitOffset>0x12</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT6STRT</name>
                                <description>Clear Counter 6 start event flag.</description>
                                <bitOffset>0x13</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CNT6STOP</name>
                                <description>Clear Counter 6 stop event flag.</description>
                                <bitOffset>0x14</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>Interrupt is not pending.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Interrupt is pending.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
