mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                    <register>
                        <name>EVENTLP_DIAGSTAT</name>
                        <description>Diagnostic Status Register</description>
                        <addressOffset>0x3FC</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x03010000</resetValue>
                        <resetMask>0xffffffff</resetMask>
                        <fields>
                            <field>
                                <name>STATE</name>
                                <description>Current diagnostic state</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x3</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NONE</name>
                                            <description>No failures and no diagnostic</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FUNC_FAIL</name>
                                            <description>Functional Failure</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DIAG_FAIL</name>
                                            <description>Diagnostic Failure</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DIAG_PASS</name>
                                            <description>Diagnostic Pass</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>NUMDIAG</name>
                                <description>This is a hardware constant that indicates how many DIAGPAR registers are included in this SFTYDIAG sub-region.</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0xA</bitWidth>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_IMPEXPCFG_EXPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x2000</addressOffset>
                    <register>
                        <name>EVENTLP_IMPEXPCFG_EXPORT_PORT</name>
                        <description>Export channel ID register</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>EVENTLP_IMPEXPCFG_IMPORT[%s]</name>
                    <description></description>
                    <addressOffset>0x2200</addressOffset>
                    <register>
                        <name>EVENTLP_IMPEXPCFG_IMPORT_PORT</name>
                        <description>Import channel ID registe</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>CHANID</name>
                                <description>Channel ID for import side to connect to</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-write</access>
                                </field>
                        </fields>
                    </register>
                </cluster>
            </registers>
        </peripheral>
        <peripheral>
            <name>USBFS0</name>
            <groupName>USBFS</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x4047F000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>24</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>USBFS0_GPRCM[%s]</name>
                    <description></description>
                    <addressOffset>0x800</addressOffset>
                    <register>
                        <name>USBFS0_PWREN</name>
                        <description>Power enable</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-write</access>
                        <fields>
                            <field>
                                <name>ENABLE</name>
                                <description>Enable the power</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disable Power</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enable Power</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_RSTCTL</name>
                        <description>Reset Control</description>
                        <addressOffset>0x4</addressOffset>
                        <size>32</size>
                        <access>write-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>RESETSTKYCLR</name>
                                <description>Clear the RESETSTKY bit in the STAT register</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOP</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CLR</name>
                                            <description>Clear reset sticky bit</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RESETASSERT</name>
                                <description>Assert reset to the peripheral</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NOP</name>
                                            <description>Writing 0 has no effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ASSERT</name>
                                            <description>Assert reset</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_STAT</name>
                        <description>Status Register</description>
                        <addressOffset>0x14</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <fields>
                            <field>
                                <name>ENABLE</name>
                                <description>Peripheral enable status</description>
                                <bitOffset>0x8</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>OFF</name>
                                            <description>Peripheral is disabled</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ON</name>
                                            <description>Peripheral is enabled</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>RESETSTKY</name>
                                <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                                <bitOffset>0x10</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NORES</name>
                                            <description>The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>RESET</name>
                                            <description>The peripheral was reset since the last bit clear</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>SWENABLE</name>
                                <description>Software enable status. Shows if enabled via PWREN.ENABLE bit</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLED</name>
                                            <description>Not enabled via PWREN.ENABLE bit</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLED</name>
                                            <description>Enabled via PWREN.ENABLE bit</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                </cluster>
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>USBFS0_CPU_INT[%s]</name>
                    <description></description>
                    <addressOffset>0x1020</addressOffset>
                    <register>
                        <name>USBFS0_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>Interrupt index status</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No bit is set means there is no pending interrupt request</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INTRTX</name>
                                            <description>Endpoint 0 and the TX Endpoints interrupt</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INTRRX</name>
                                            <description>RX Endpoints interrupt</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INTRUSB</name>
                                            <description>USB Interrupts</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>VUSBPWRDN</name>
                                            <description>VUSB power down</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONEARX</name>
                                            <description>DMA-Done interrupt for Trigger USB-A-RX</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONEATX</name>
                                            <description>DMA-Done interrupt for Trigger USB-A-TX</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONEBRX</name>
                                            <description>DMA-Done interrupt for Trigger USB-B-RX</description>
                                            <value>0x7</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONEBTX</name>
                                            <description>DMA-Done interrupt for Trigger USB-B-TX</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONECRX</name>
                                            <description>DMA-Done interrupt for Trigger USB-C-RX</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONECTX</name>
                                            <description>DMA-Done interrupt for Trigger USB-C-TX</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONEDRX</name>
                                            <description>DMA-Done interrupt for Trigger USB-D-RX</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMADONEDTX</name>
                                            <description>DMA-Done interrupt for Trigger USB-D-TX</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMAPREARX</name>
                                            <description>DMA-Pre interrupt for Trigger USB-A-RX</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMAPREATX</name>
                                            <description>DMA-Pre interrupt for Trigger USB-A-TX</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMAPREBRX</name>
                                            <description>DMA-Pre interrupt for Trigger USB-B-RX</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMAPREBTX</name>
                                            <description>DMA-Pre interrupt for Trigger USB-B-TX</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMAPRECRX</name>
                                            <description>DMA-Pre interrupt for Trigger USB-C-RX</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMAPRECTX</name>
                                            <description>DMA-Pre interrupt for Trigger USB-C-TX</description>
                                            <value>0x12</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMAPREDRX</name>
                                            <description>DMA-Pre interrupt for Trigger USB-D-RX</description>
                                            <value>0x13</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>DMAPREDTX</name>
                                            <description>DMA-Pre interrupt for Trigger USB-D-TX</description>
                                            <value>0x14</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
