mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>USBFS0_USBDMASEL</name>
                    <description>USB DMA trigger select</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TRIGARX</name>
                            <description>TRIG A RX select specifies the RX mapping of the USB endpoint on DMA trigger USB-A-RX</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Endpoint 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Endpoint 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Endpoint 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Endpoint 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Endpoint 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Endpoint 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Endpoint 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIGATX</name>
                            <description>TRIG A TX select specifies the TX mapping of the USB endpoint on DMA  trigger USB-A-TX</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Endpoint 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Endpoint 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Endpoint 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Endpoint 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Endpoint 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Endpoint 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Endpoint 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIGBRX</name>
                            <description>TRIG B RX select specifies the RX mapping of the USB endpoint on DMA  trigger USB-B-RX</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Endpoint 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Endpoint 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Endpoint 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Endpoint 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Endpoint 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Endpoint 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Endpoint 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIGBTX</name>
                            <description>TRIG B TX select specifies the TX mapping of the USB endpoint on DMA  trigger USB-B-TX</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Endpoint 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Endpoint 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Endpoint 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Endpoint 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Endpoint 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Endpoint 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Endpoint 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIGCRX</name>
                            <description>TRIG C RX select specifies the RX mapping of the USB endpoint on DMA  trigger USB-C-RX</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Endpoint 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Endpoint 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Endpoint 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Endpoint 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Endpoint 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Endpoint 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Endpoint 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIGCTX</name>
                            <description>TRIG C TX select specifies the TX mapping of the USB endpoint on DMA  trigger USB-C-TX</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Endpoint 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Endpoint 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Endpoint 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Endpoint 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Endpoint 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Endpoint 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Endpoint 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIGDRX</name>
                            <description>TRIG D RX select specifies the RX mapping of the USB endpoint on DMA  trigger USB-D-RX</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Endpoint 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Endpoint 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Endpoint 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Endpoint 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Endpoint 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Endpoint 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Endpoint 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TRIGDTX</name>
                            <description>TRIG D TX select specifies the TX mapping of the USB endpoint on DMA  trigger USB-D-TX</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DIS</name>
                                        <description>Disabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP1</name>
                                        <description>Endpoint 1</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP2</name>
                                        <description>Endpoint 2</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP3</name>
                                        <description>Endpoint 3</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP4</name>
                                        <description>Endpoint 4</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP5</name>
                                        <description>Endpoint 5</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP6</name>
                                        <description>Endpoint 6</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EP7</name>
                                        <description>Endpoint 7</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
