mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>USBFS0_RXIS</name>
                    <description>USB Receive Interrupt Status</description>
                    <addressOffset>0x2004</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EP1</name>
                            <description>Recieve Endpoint 1 Interrupt</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 1 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP2</name>
                            <description>Recieve Endpoint 2 Interrupt</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 2 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP3</name>
                            <description>Recieve Endpoint 3 Interrupt</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 3 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP4</name>
                            <description>Recieve Endpoint 4 Interrupt</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 4 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP5</name>
                            <description>Recieve Endpoint 5 Interrupt</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 5 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP6</name>
                            <description>Recieve Endpoint 6 Interrupt</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 6 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP7</name>
                            <description>Recieve Endpoint 7 Interrupt</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_INT</name>
                                        <description>No interrupt</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>INT</name>
                                        <description>The Endpoint 7 transmit interrupt is asserted.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_TXIE</name>
                    <description>USB Transmit Interrupt Enable</description>
                    <addressOffset>0x2006</addressOffset>
                    <size>16</size>
                    <resetValue>0x000000ff</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EP0</name>
                            <description>Transmit Endpoint 0 Interrupt Enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The EP0 transmit and receive interrupt is suppressed and not sent to the interupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the EP0 bit in the USBTXIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP1</name>
                            <description>Transmit Endpoint 1 Interrupt Enable</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The EP1 transmit interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the EP1 bit in the USBTXIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP2</name>
                            <description>Transmit Endpoint 2 Interrupt Enable</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The EP2 transmit interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the EP2 bit in the USBTXIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP3</name>
                            <description>Transmit Endpoint 3 Interrupt Enable</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The EP3 transmit interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the EP3 bit in the USBTXIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP4</name>
                            <description>Transmit Endpoint 4 Interrupt Enable</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The EP4 transmit interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the EP4 bit in the USBTXIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP5</name>
                            <description>Transmit Endpoint 5 Interrupt Enable</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The EP5 transmit interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the EP5 bit in the USBTXIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP6</name>
                            <description>Transmit Endpoint 6 Interrupt Enable</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The EP6 transmit interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the EP6 bit in the USBTXIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>EP7</name>
                            <description>Transmit Endpoint 7 Interrupt Enable</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The EP7 transmit interrupt is suppressed and not sent to the interrupt controller.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>An interrupt is sent to the interrupt controller when the EP7 bit in the USBTXIS register is set.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
