mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                                        <description>608.0</description>
                                        <value>0x4C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_616</name>
                                        <description>616.0</description>
                                        <value>0x4D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_624</name>
                                        <description>624.0</description>
                                        <value>0x4E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_632</name>
                                        <description>632.0</description>
                                        <value>0x4F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_640</name>
                                        <description>640.0</description>
                                        <value>0x50</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_648</name>
                                        <description>648.0</description>
                                        <value>0x51</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_656</name>
                                        <description>656.0</description>
                                        <value>0x52</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_664</name>
                                        <description>664.0</description>
                                        <value>0x53</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_672</name>
                                        <description>672.0</description>
                                        <value>0x54</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_680</name>
                                        <description>680.0</description>
                                        <value>0x55</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_688</name>
                                        <description>688.0</description>
                                        <value>0x56</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_696</name>
                                        <description>696.0</description>
                                        <value>0x57</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_704</name>
                                        <description>704.0</description>
                                        <value>0x58</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_712</name>
                                        <description>712.0</description>
                                        <value>0x59</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_720</name>
                                        <description>720.0</description>
                                        <value>0x5A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_728</name>
                                        <description>728.0</description>
                                        <value>0x5B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_736</name>
                                        <description>736.0</description>
                                        <value>0x5C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_744</name>
                                        <description>744.0</description>
                                        <value>0x5D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_752</name>
                                        <description>752.0</description>
                                        <value>0x5E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_760</name>
                                        <description>760.0</description>
                                        <value>0x5F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_768</name>
                                        <description>768.0</description>
                                        <value>0x60</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_776</name>
                                        <description>776.0</description>
                                        <value>0x61</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_784</name>
                                        <description>784.0</description>
                                        <value>0x62</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_792</name>
                                        <description>792.0</description>
                                        <value>0x63</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_800</name>
                                        <description>800.0</description>
                                        <value>0x64</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_808</name>
                                        <description>808.0</description>
                                        <value>0x65</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_816</name>
                                        <description>816.0</description>
                                        <value>0x66</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_824</name>
                                        <description>824.0</description>
                                        <value>0x67</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_832</name>
                                        <description>832.0</description>
                                        <value>0x68</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_840</name>
                                        <description>840.0</description>
                                        <value>0x69</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_848</name>
                                        <description>848.0</description>
                                        <value>0x6A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_856</name>
                                        <description>856.0</description>
                                        <value>0x6B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_864</name>
                                        <description>864.0</description>
                                        <value>0x6C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_872</name>
                                        <description>872.0</description>
                                        <value>0x6D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_880</name>
                                        <description>880.0</description>
                                        <value>0x6E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_888</name>
                                        <description>888.0</description>
                                        <value>0x6F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_896</name>
                                        <description>896.0</description>
                                        <value>0x70</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_904</name>
                                        <description>904.0</description>
                                        <value>0x71</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_912</name>
                                        <description>912.0</description>
                                        <value>0x72</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_920</name>
                                        <description>920.0</description>
                                        <value>0x73</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_928</name>
                                        <description>928.0</description>
                                        <value>0x74</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_936</name>
                                        <description>936.0</description>
                                        <value>0x75</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_944</name>
                                        <description>944.0</description>
                                        <value>0x76</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_952</name>
                                        <description>952.0</description>
                                        <value>0x77</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_960</name>
                                        <description>960.0</description>
                                        <value>0x78</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_968</name>
                                        <description>968.0</description>
                                        <value>0x79</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_976</name>
                                        <description>976.0</description>
                                        <value>0x7A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_984</name>
                                        <description>984.0</description>
                                        <value>0x7B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_992</name>
                                        <description>992.0</description>
                                        <value>0x7C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1000</name>
                                        <description>1000.0</description>
                                        <value>0x7D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1008</name>
                                        <description>1008.0</description>
                                        <value>0x7E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1016</name>
                                        <description>1016.0</description>
                                        <value>0x7F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1024</name>
                                        <description>1024.0</description>
                                        <value>0x80</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1032</name>
                                        <description>1032.0</description>
                                        <value>0x81</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1040</name>
                                        <description>1040.0</description>
                                        <value>0x82</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1048</name>
                                        <description>1048.0</description>
                                        <value>0x83</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1056</name>
                                        <description>1056.0</description>
                                        <value>0x84</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1064</name>
                                        <description>1064.0</description>
                                        <value>0x85</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1072</name>
                                        <description>1072.0</description>
                                        <value>0x86</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1080</name>
                                        <description>1080.0</description>
                                        <value>0x87</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1088</name>
                                        <description>1088.0</description>
                                        <value>0x88</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1096</name>
                                        <description>1096.0</description>
                                        <value>0x89</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1104</name>
                                        <description>1104.0</description>
                                        <value>0x8A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1112</name>
                                        <description>1112.0</description>
                                        <value>0x8B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1120</name>
                                        <description>1120.0</description>
                                        <value>0x8C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1128</name>
                                        <description>1128.0</description>
                                        <value>0x8D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1136</name>
                                        <description>1136.0</description>
                                        <value>0x8E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1144</name>
                                        <description>1144.0</description>
                                        <value>0x8F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1152</name>
                                        <description>1152.0</description>
                                        <value>0x90</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1160</name>
                                        <description>1160.0</description>
                                        <value>0x91</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1168</name>
                                        <description>1168.0</description>
                                        <value>0x92</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1176</name>
                                        <description>1176.0</description>
                                        <value>0x93</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1184</name>
                                        <description>1184.0</description>
                                        <value>0x94</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1192</name>
                                        <description>1192.0</description>
                                        <value>0x95</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1200</name>
                                        <description>1200.0</description>
                                        <value>0x96</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1208</name>
                                        <description>1208.0</description>
                                        <value>0x97</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1216</name>
                                        <description>1216.0</description>
                                        <value>0x98</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1224</name>
                                        <description>1224.0</description>
                                        <value>0x99</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_1232</name>
                                        <description>1232.0</description>
                                        <value>0x9A</value>
                                    </enumeratedValue>
