mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>USBFS0_IDXRXFIFOADD</name>
                    <description>Indexed USB Receive FIFO Start Address</description>
                    <addressOffset>0x2066</addressOffset>
                    <size>16</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Endpoint Data</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xE</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ADDR_0</name>
                                        <description>0.0</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_8</name>
                                        <description>8.0</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_16</name>
                                        <description>16.0</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_24</name>
                                        <description>24.0</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_32</name>
                                        <description>32.0</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_40</name>
                                        <description>40.0</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_48</name>
                                        <description>48.0</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_56</name>
                                        <description>56.0</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_64</name>
                                        <description>64.0</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_72</name>
                                        <description>72.0</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_80</name>
                                        <description>80.0</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_88</name>
                                        <description>88.0</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_96</name>
                                        <description>96.0</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_104</name>
                                        <description>104.0</description>
                                        <value>0xD</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_112</name>
                                        <description>112.0</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_120</name>
                                        <description>120.0</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_128</name>
                                        <description>128.0</description>
                                        <value>0x10</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_136</name>
                                        <description>136.0</description>
                                        <value>0x11</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_144</name>
                                        <description>144.0</description>
                                        <value>0x12</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_152</name>
                                        <description>152.0</description>
                                        <value>0x13</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_160</name>
                                        <description>160.0</description>
                                        <value>0x14</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_168</name>
                                        <description>168.0</description>
                                        <value>0x15</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_176</name>
                                        <description>176.0</description>
                                        <value>0x16</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_184</name>
                                        <description>184.0</description>
                                        <value>0x17</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_192</name>
                                        <description>192.0</description>
                                        <value>0x18</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_200</name>
                                        <description>200.0</description>
                                        <value>0x19</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_208</name>
                                        <description>208.0</description>
                                        <value>0x1A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_216</name>
                                        <description>216.0</description>
                                        <value>0x1B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_224</name>
                                        <description>224.0</description>
                                        <value>0x1C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_232</name>
                                        <description>232.0</description>
                                        <value>0x1D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_240</name>
                                        <description>240.0</description>
                                        <value>0x1E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_248</name>
                                        <description>248.0</description>
                                        <value>0x1F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_256</name>
                                        <description>256.0</description>
                                        <value>0x20</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_264</name>
                                        <description>264.0</description>
                                        <value>0x21</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_272</name>
                                        <description>272.0</description>
                                        <value>0x22</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_280</name>
                                        <description>280.0</description>
                                        <value>0x23</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_288</name>
                                        <description>288.0</description>
                                        <value>0x24</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_296</name>
                                        <description>296.0</description>
                                        <value>0x25</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_304</name>
                                        <description>304.0</description>
                                        <value>0x26</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_312</name>
                                        <description>312.0</description>
                                        <value>0x27</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_320</name>
                                        <description>320.0</description>
                                        <value>0x28</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_328</name>
                                        <description>328.0</description>
                                        <value>0x29</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_336</name>
                                        <description>336.0</description>
                                        <value>0x2A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_344</name>
                                        <description>344.0</description>
                                        <value>0x2B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_352</name>
                                        <description>352.0</description>
                                        <value>0x2C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_360</name>
                                        <description>360.0</description>
                                        <value>0x2D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_368</name>
                                        <description>368.0</description>
                                        <value>0x2E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_376</name>
                                        <description>376.0</description>
                                        <value>0x2F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_384</name>
                                        <description>384.0</description>
                                        <value>0x30</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_392</name>
                                        <description>392.0</description>
                                        <value>0x31</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_400</name>
                                        <description>400.0</description>
                                        <value>0x32</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_408</name>
                                        <description>408.0</description>
                                        <value>0x33</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_416</name>
                                        <description>416.0</description>
                                        <value>0x34</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_424</name>
                                        <description>424.0</description>
                                        <value>0x35</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_432</name>
                                        <description>432.0</description>
                                        <value>0x36</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_440</name>
                                        <description>440.0</description>
                                        <value>0x37</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_448</name>
                                        <description>448.0</description>
                                        <value>0x38</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_456</name>
                                        <description>456.0</description>
                                        <value>0x39</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_464</name>
                                        <description>464.0</description>
                                        <value>0x3A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_472</name>
                                        <description>472.0</description>
                                        <value>0x3B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_480</name>
                                        <description>480.0</description>
                                        <value>0x3C</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_488</name>
                                        <description>488.0</description>
                                        <value>0x3D</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_496</name>
                                        <description>496.0</description>
                                        <value>0x3E</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_504</name>
                                        <description>504.0</description>
                                        <value>0x3F</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_512</name>
                                        <description>512.0</description>
                                        <value>0x40</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_520</name>
                                        <description>520.0</description>
                                        <value>0x41</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_528</name>
                                        <description>528.0</description>
                                        <value>0x42</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_536</name>
                                        <description>536.0</description>
                                        <value>0x43</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_544</name>
                                        <description>544.0</description>
                                        <value>0x44</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_552</name>
                                        <description>552.0</description>
                                        <value>0x45</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_560</name>
                                        <description>560.0</description>
                                        <value>0x46</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_568</name>
                                        <description>568.0</description>
                                        <value>0x47</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_576</name>
                                        <description>576.0</description>
                                        <value>0x48</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_584</name>
                                        <description>584.0</description>
                                        <value>0x49</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_592</name>
                                        <description>592.0</description>
                                        <value>0x4A</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_600</name>
                                        <description>600.0</description>
                                        <value>0x4B</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ADDR_608</name>
