mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>USBFS0_CSR0L</name>
                    <description>USB Control and Status Endpoint 0 Low</description>
                    <addressOffset>0x2102</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>RXRDY</name>
                            <description>Receive Packet Ready.
Device mode: This bit is set when a data packet has been received. An interrupt is generated when this bit is set. The CPU clears this bit by setting the RXRDYC_STATUS bit.
Host mode: Software must clear this bit after he packet has been read from the FIFO to acknowledge that the data has been read from the FIFO.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_PACKET</name>
                                        <description>No receive packet has been received.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RECV</name>
                                        <description>Indicates that a data packet has been received in the RX FIFO. The EP0 bit in the USBTXIS register is also set in this situation.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXRDY</name>
                            <description>Transmit Packet Ready.
Device &amp; Host mode: The CPU sets this bit after loading a data packet into the FIFO. It is cleared automatically when a data packet has been transmitted. An interrupt is also generated at this point (if enabled).
Host mode: If both the TXRDY and DATAEND_SETUP bits are set, a setup packet is sent. If just TXRDY is set, an OUT packet is sent.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>WAIT</name>
                                        <description>No transmit packet is ready.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>READY</name>
                                        <description>Software sets this bit after loading a data packet into the TX FIFO. The EP0 bit in the USBTXIS register is also set in this situation.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STALLED</name>
                            <description>Sent Stall / Receive Stall 
Device mode: This bit is set when a STALL handshake is transmitted. The CPU should clear this bit.
Host mode: This bit is set when a STALL handshake is received. The CPU should clear this bit.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_HANDSHAKE</name>
                                        <description>No handshake has been received.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HANDSHAKE</name>
                                        <description>A STALL handshake has been received or transmitted</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DATAEND_SETUP</name>
                            <description>Data end / Setup Packet.
Device mode: Data end bit. The CPU sets this bit: 
1. When setting TXRDY for the last data packet.
2. When clearing RXRDY after unloading the last data packet.
3. When setting TXRDY for a zero length data packet.
Host mode: Setup packet. The CPU sets this bit, at the same time as the TXRDY bit is set, to send a SETUP token instead of an OUT token for the transaction.
Note: Setting this bit always clears the DT bit in the USBCSRH0 register.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>No effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Indicates date end or sends setup token.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SETEND_ERROR</name>
                            <description>Setup end / Error.
Device mode: Setup end. This bit will be set when a control transaction ends before the DATAEND_SETUP bit has been set. An interrupt will be generated and the FIFO flushed at this time. The bit is cleared by the CPU writing a 1 to the SETENDC_NAKTO bit.
Host mode: Error indication. This bit will be set when three attempts have been made to perform a transaction with no response from the peripheral. The CPU should clear this bit. An interrupt is generated when this bit is set.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>Clear Error. Note: Only effective in host mode.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Setup end / Error indication.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STALL_RQPKT</name>
                            <description>Send Stall / Request Packet.
Device mode: The CPU writes a 1 to this bit to terminate the current transaction. The STALL handshake will be transmitted and then this bit will be cleared automatically.
Host mode: The CPU sets this bit to request an IN transaction. It is cleared when RXRDY bit is set.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>No effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Send stall request or request packet is in effect.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXRDYC_STATUS</name>
                            <description>Receive ready clear / Status packet
Device mode: Receive ready clear. The CPU writes a 1 to this bit to clear the RXRDY bit. It is cleared automatically
Host mode: Status Packet. The CPU sets this bit at the same time as the TXRDY or STALL_RQPKT bit is set, to perform a status stage transaction. Setting this bit ensures that the DT bit is set in the USBCSRH0 register, so that a DATA1 packet is used for the Status Stage transaction.

Setting this bit ensures that the DT bit is set in the USBCSRH0 register so that a DATA1 packet is used for the STATUS stage transaction.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>No transaction</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Clear RXRDY or sent status packet.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SETENDC_NAKTO</name>
                            <description>Setup End Clear / NAK Timeout
Device mode: The CPU writes a 1 to this bit to clear the SETEND_ERROR bit. It is cleared automatically.
Host mode: This bit will be set when Endpoint 0 is halted following the receipt of NAK responses for longer than the time set by the USBNAKLMT register. The CPU should clear this bit to allow the endpoint to continue.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>No effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Clear SETEND_ERROR or SETENDC_KAKTO</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_CSR0H</name>
                    <description>USB Control and Status Endpoint 0 High</description>
                    <addressOffset>0x2103</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>FLUSH</name>
                            <description>Flush FIFO.
The CPU writes a 1 to this bit to flush the next packet to be transmitted/read from the Endpoint 0 FIFO. The FIFO pointer is reset and the TXRDY/RXRDY bit in the USBCSRL0 register is cleared.
Note: FLUSH should only be used when TXRDY/RXRDY is set. At other times, it may cause data to be corrupted.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NO_EFFECT</name>
                                        <description>No effect</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>EFFECT</name>
                                        <description>Flush the FIFO</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DT</name>
                            <description>Data Toggle.
When read, this bit indicates the current state of the endpoint 0 data toggle. If DTWE is set, this bit may be written with the required setting of the data toggle. If DTWE is Low, this bit cannot be written. Care should be taken when writing to this bit as it should only be changed to RESET USB endpoint 0.
Note: This bit is only effective in host mode.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LOW</name>
                                        <description>Data toggle is low</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>HIGH</name>
                                        <description>Data toggle is high</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DTWE</name>
                            <description>Data Toggle Write Enable.
This bit is automatically cleared once the new value is written.
Note: This bit is only effective in host mode.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>The DT bit cannot be written.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enables the current state of the endpoint 0 data toggle to be written (see DT bit).</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DISPING</name>
                            <description>Diable PING tokens in data and status phases of a high-speed Control transfer.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLR</name>
                                        <description>Ping is allowed.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>Ping is not allowed.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_COUNT0</name>
                    <description>USB Receive Byte Count Endpoint 0</description>
                    <addressOffset>0x2108</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>COUNT</name>
                            <description>FIFO Count.
COUNT is a read-only value that indicates the number of received data bytes in the endpoint 0 FIFO.
The value returned changes as the contents of the FIFO change and is only valid while RXRDY (USBCSRL.RXRDY) is set.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x7</bitWidth>
                            <access>read-only</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_TYPE0</name>
                    <description>USB Type Endpoint 0</description>
                    <addressOffset>0x210A</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>SPEED</name>
                            <description>Operating Speed specifies the operating speed of the target Device. If selected, the target is assumed  #br#to have the same connection speed as the USB controller.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>UNUSED</name>
                                        <description>Unused (Note: If selected, the target will be assumed to be using the same connection speed as the USB controller.)</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>FULL</name>
                                        <description>Full-speed</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LOW</name>
                                        <description>Low-speed</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>USBFS0_NAKLMT0</name>
                    <description>USB NAK Limit Endpoint 0</description>
                    <addressOffset>0x210B</addressOffset>
                    <size>8</size>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>NAKLMT</name>
                            <description>EP0 NAK Limit specifies the number of frames after receiving a stream of NAK responses.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
