mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                    <register>
                        <name>USBFS0_RXCSRL</name>
                        <description>USB Receive Control and Status Endpoint [n] Low</description>
                        <addressOffset>0x6</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>RXRDY</name>
                                <description>Receive Packet Ready.
This bit is set when a data packet has been received. The CPU should clear this bit when the packet has been unloaded from the Rx FIFO. An interrupt is generated when the bit is set.
If the AUTOCLR bit in the USBRXCSRH[n] register is set, then the this bit is automatically cleared when a packet of USBRXMAXP[n] bytes has been unloaded from the receive FIFO. If the AUTOCLR bit is clear, or if packets of less than the maximum packet size are unloaded, then software must clear this bit manually when the packet has been unloaded from the receive FIFO.
Note: Device and host mode.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>WAIT</name>
                                            <description>No data packet has been received.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>READY</name>
                                            <description>Indicates that a data packet has been received. The EP[j] bit in the USBTXIS register is also set in this situation</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FULL</name>
                                <description>FIFO Full.
This bit is set when no more packets can be loaded into the RX FIFO.
Note: Device and host mode.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO</name>
                                            <description>The receive FIFO is not full.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>YES</name>
                                            <description>The receive FIFO is full. No more packets can be loaded into the receive FIFO.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>OVERERROR</name>
                                <description>Over run / Error.
Device mode: Over run - This bit is set if an OUT packet cannot be loaded into the receive FIFO. The CPU should clear this bit. - Note: This bit is only valid when the endpoint is operating in ISO mode. In Bulk mode, it always returns zero.
Host mode: The USB sets this bit when 3 attempts have been made to receive a packet and no data packet has been received. The CPU should clear this bit. An interrupt is generated when the bit is set. - Note: This bit is only valid when the RX endpoint is operating in Bulk or Interrupt mode. In ISO mode, it always returns zero.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>No over run or error condition.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Under run or error condition exist.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DATAERRNAKTO</name>
                                <description>Data Error / NAK Timeout
Device mode: Data Error - This bit is set when RXRDY is set, if the data packet has a CRC or bit-stuff error. It is cleared when RXRDY is cleared. - Note: This bit is only valid when the endpoint is operating in ISO mode. In Bulk mode, it always returns zero.
Host mode: NAK Timeout - When operating in ISO mode, this bit is set when RXRDY is set, if the data packet has a CRC or bit-stuff error and cleared when RXRDY is cleared. In Bulk mode, this bit will be set when the Rx endpoint is halted following the receipt of NAK responses for longer than the time set as the NAK Limit by the USBRXINTERVAL register. The CPU should clear this bit to allow the endpoint to continue.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>Normal operation</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Data error or NAK Timeout condition exist.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>FLUSH</name>
                                <description>Flush FIFO.
The CPU writes a 1 to this bit to flush the next packet to be read from the endpoint RX FIFO. The FIFO pointer is reset and the RXRDY bit is cleared. 
Note: Thsi bit should only be set when RXRDY is set. At other times, it may cause data to be corrupted. 
Note: If the FIFO is double-buffered, FLUSH may need to be set twice to completely clear the FIFO.
Note: Device and host mode.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>EFFECT</name>
                                            <description>Flushes the next packet to be read from the endpoint receive FIFO. The FIFO pointer is reset and the RXRDY bit is cleared</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>STALLREQPKT</name>
                                <description>Send Stall / Request Packet.
Device mode: The CPU writes a 1 to this bit to issue a STALL handshake. The CPU clears this bit to terminate the stall condition. - Note: This bit has no effect where the endpoint is being used for Isochronous transfers.
Host mode: The CPU writes a 1 to this bit to request an IN transaction. It is cleared when RXRDY is set.</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CLEAR</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>SET</name>
                                            <description>Send stall or packet request.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>STALLED</name>
                                <description>Sent Stall / RX Stall
Device mode: This bit is set when a STALL handshake is transmitted. The CPU should clear this bit.
Host mode: When a STALL handshake is received, this bit is set and an interrupt is generated. The CPU should clear this bit.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>STALLED_WAIT</name>
                                            <description>No handshake has been received.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>STALLED_RECEIVE</name>
                                            <description>A STALL handshake has been received. The EPn bit in the USBRXIS register is also set.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>CLRDT</name>
                                <description>Clear Data Toggle.
The CPU writes a 1 to this bit to reset the endpoint data toggle to 0.
Note: Device and host mode.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>write-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_EFFECT</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>EFFECT</name>
                                            <description>Writing a 1 to this bit clears the DT bit in the USBRXCSRH[n] register.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
