mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                    <register>
                        <name>USBFS0_RXCSRH</name>
                        <description>USB Receive Control and Status Endpoint [n] High</description>
                        <addressOffset>0x7</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>INCOMPRX</name>
                                <description>This bit will be set in a high-bandwidth Isochronous or Interrupt transfer if the packet received is incomplete, because parts of the data were not received. It is cleared when RXRDY is cleared.
Note: In anything other than Isochronous transfer, this bit will always return 0.
Note: Device and host mode.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>DT</name>
                                <description>Data Toggle.
When read, this bit indicates the current state of the receive data toggle. If DTWE is High, this bit may be written with the required setting of the data toggle. If DTWE is Low, any value written to this bit is ignored. Care should be taken when writing to this bit as it should only be changed to RESET the receive endpoint.
Note: Host mode only.</description>
                                <bitOffset>0x1</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>LOW</name>
                                            <description>Data toggle is low</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>HIGH</name>
                                            <description>Data toggle is high</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DTWE</name>
                                <description>Data Toggle Write Enable.
The CPU writes a 1 to this bit to enable the current state of the Endpoint 0 data toggle to be written. This bit is automatically cleared once the new value is written.
Note: Host mode only.</description>
                                <bitOffset>0x2</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>The DT bit cannot be written.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enables the current state of the receive endpoint data to be written (see DT bit).</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMAMOD</name>
                                <description>DMA request mode
The CPU sets this bit to select DMA Request Mode 1 and clears it to select DMA Request Mode 0.
Note: This bit must not be cleared either before or in the same cycle as the above DMAEN bit is cleared.
Note: Device and host mode.</description>
                                <bitOffset>0x3</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>MODE0</name>
                                            <description>An interrupt is generated after every DMA packet transfer.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>MODE1</name>
                                            <description>An interrupt is generated only after the entire DMA transfer is complete.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>PIDERR</name>
                                <description>PID error
ISO Transactions: The USB controller sets this bit to indicate a PID error in the received packet.
Bulk/Interrupt Transactions: The setting of this bit is ignored.
Note: Device and host mode.</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_ERROR</name>
                                            <description>No error</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ERROR</name>
                                            <description>Indicates a PID error in the received packet of an isochronous transaction.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>DMAEN</name>
                                <description>DMA Request Enable
The CPU sets this bit to enable the DMA request for the Rx endpoint.
Note: Four TX and four RX endpoints can be connected to the DMA module. If this bit is set for a particular endpoint, the TRIGARX, TRIGBRX, TRIGCRX, or TRIGDRX field in the USB DMA Select (USBDMASEL) register must be programmed correspondingly</description>
                                <bitOffset>0x5</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>Disables the DMA request for the receive endpoint.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enables the DMA request for the receive endpoint.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>ISOAUTORQ</name>
                                <description>Isochronous transfer mode / Auto request.
Device mode: The CPU sets this bit to enable the Rx endpoint for Isochronous transfers, and clears it to enable the Rx endpoint for Bulk/Interrupt transfers.
Host mode: If the CPU sets this bit, the STALLREQPKT bit will be automatically set when the RXRDY bit is cleared. - Note: This bit is automatically cleared when a short packet is received.</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DISABLE</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Sets ISO transfer mode or enables the REQPKT bit to be automatically set when the RXRDY bit is cleared.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>AUTOCLR</name>
                                <description>Auto Clear.
If the CPU sets this bit then the RXRDY bit will be automatically cleared when a packet of USBRXMAXP bytes has been unloaded from the RX FIFO. When packets of less than the maximum packet size are unloaded, RXRDY will have to be cleared manually. When using a DMA to unload the RX-FIFO, data is read from the RX-FIFO in 4 byte chunks regardless of the USBRXMAXP setting.
Note: Device and host mode.</description>
                                <bitOffset>0x7</bitOffset>
                                <bitWidth>0x1</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DSIABLE</name>
                                            <description>No effect</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ENABLE</name>
                                            <description>Enables the RXRDY bit to be automatically cleared when a packet of USBRXMAXP[n] bytes has been unloaded from the receive FIFO.</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_RXCOUNT</name>
                        <description>USB Receive Byte Count Endpoint [n]</description>
                        <addressOffset>0x8</addressOffset>
                        <size>16</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x0000ffff</resetMask>
                        <fields>
                            <field>
                                <name>COUNT</name>
                                <description>Receive Packet Count indicates the number of bytes in the receive packet.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0xD</bitWidth>
                                <access>read-only</access>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_TXTYPE</name>
                        <description>USB Host Transmit Configure Type Endpoint [n]</description>
                        <addressOffset>0xA</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>TEP</name>
                                <description>Target Endpoint Number.
Software must configure this value to the endpoint number contained in the transmit endpoint descriptor returned to the USB controller during Device enumeration.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>PROTO</name>
                                <description>Protocol.
Software must configure this bit field to select the required protocol for the transmit endpoint:</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CTRL</name>
                                            <description>Control</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ISO</name>
                                            <description>isochronous</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>BULK</name>
                                            <description>Bulk</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT</name>
                                            <description>Interrupt</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>SPEED</name>
                                <description>Operating Speed.
This bit field specifies the operating speed of the target Device:</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DEFAULT</name>
                                            <description>Default. The target is assumed to be using the same connection speed as the USB controller.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FULL</name>
                                            <description>Full speed</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LOW</name>
                                            <description>Low speed</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_TXINTERVAL</name>
                        <description>USB Host Transmit Interval Endpoint [n]</description>
                        <addressOffset>0xB</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_RXTYPE</name>
                        <description>USB Host Configure Receive Type Endpoint [n]</description>
                        <addressOffset>0xC</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                            <field>
                                <name>TEP</name>
                                <description>Target Endpoint Number.
Software must configure this value to the endpoint number contained in the transmit endpoint descriptor returned to the USB controller during Device enumeration.</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x4</bitWidth>
                                <access>read-write</access>
                                </field>
                            <field>
                                <name>PROTO</name>
                                <description>Protocol.
Software must configure this bit field to select the required protocol for the transmit endpoint:</description>
                                <bitOffset>0x4</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>CTRL</name>
                                            <description>Control</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>ISO</name>
                                            <description>isochronous</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>BULK</name>
                                            <description>Bulk</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INT</name>
                                            <description>Interrupt</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                            <field>
                                <name>SPEED</name>
                                <description>Operating Speed.  #br#This bit field specifies the operating speed of the target Device:</description>
                                <bitOffset>0x6</bitOffset>
                                <bitWidth>0x2</bitWidth>
                                <access>read-write</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>DEFAULT</name>
                                            <description>Default. The target is assumed to be using the same connection speed as the USB controller.</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>FULL</name>
                                            <description>Full speed</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>LOW</name>
                                            <description>Low speed</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
                    <register>
                        <name>USBFS0_RXINTERVAL</name>
                        <description>USB Host Receive Polling Interval Endpoint [n]</description>
                        <addressOffset>0xD</addressOffset>
                        <size>8</size>
                        <resetValue>0x00000000</resetValue>
                        <resetMask>0x000000ff</resetMask>
                        <fields>
                        </fields>
                    </register>
