mspm0-rs/mspm0-data-sources/svd/MSPM0G518X.svd
                <register>
                    <name>UC0_UART_STAT</name>
                    <description>UART Status Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>BUSY</name>
                            <description>UART Busy
			This bit is set as soon as the transmit FIFO/buffer becomes non-empty (regardless of whether UART is enabled) or if a receive data is currently ongoing (after the start edge have been detected until a complete byte, including all stop bits, has been received by the shift register).
In IDLE_Line mode the Busy signal also stays set during the idle time generation.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The UART is not busy.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>The UART is busy transmitting data. This bit remains set until the complete byte, including all stop bits, has been sent/received from/into the shift register.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXFF</name>
                            <description>UART Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The transmitter is not full.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>transmit FIFO is full.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXFF</name>
                            <description>UART Receive FIFO Full</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The receiver can receive data.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>receive FIFO is full.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXFE</name>
                            <description>UART Transmit FIFO Empty</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The transmitter has data to transmit.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>transmit FIFO is empty.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>CTS</name>
                            <description>Clear To Send</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The CTS signal is not asserted (high).</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>The CTS signal is asserted (low).</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>IDLE</name>
                            <description>IDLE mode has been detected in Idleline-Multiprocessor-Mode.
The IDLE bit is used as an address tag for each block of characters. In idle-line multiprocessor format, this bit is set when a received character is an address.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>IDLE has not been detected before last received character.
(In idle-line multiprocessor mode).</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>IDLE has been detected before last received character.
(In idle-line multiprocessor mode).</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXFE</name>
                            <description>UART Receive FIFO Empty</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>The receiver is not empty.</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>eceive FIFO is empty.</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXCLR</name>
                            <description>RX FIFO Clear Status</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>FIFO is not cleared</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>FIFO clear is complete</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>TXCLR</name>
                            <description>TX FIFO Clear Status</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>FIFO is not cleared</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>FIFO clear is complete</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SENDIDLE</name>
                            <description>TX FIFO Clear Status</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEARED</name>
                                        <description>IDLE condition has not yet been sent on the line</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>SET</name>
                                        <description>IDLE condition has been sent on the line</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC0_UART_IFLS</name>
                    <description>UART Interrupt FIFO Level Select Register</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000022</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TXIFLSEL</name>
                            <description>FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LVL_3_4</name>
                                        <description>TX FIFO &lt;= 3/4 empty</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_2</name>
                                        <description>TX FIFO &lt;= 1/2 empty (default)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_4</name>
                                        <description>TX FIFO &lt;= 1/4 empty</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_NOT_FULL</name>
                                        <description>Opposite of full</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_EMPTY</name>
                                        <description>TX FIFO is empty</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_EMPTY</name>
                                        <description>TX FIFO &lt;= 1</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_FULL</name>
                                        <description>TX_FIFO &gt;= (MAX_FIFO_LEN -1)</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXIFLSEL</name>
                            <description>FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>LVL_1_4</name>
                                        <description>RX FIFO &gt;= 1/4 full</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_1_2</name>
                                        <description>RX FIFO &gt;= 1/2 full (default)</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_3_4</name>
                                        <description>RX FIFO &gt;= 3/4 full</description>
                                        <value>0x3</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_NOT_EMPTY</name>
                                        <description>Opposite of empty</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_FULL</name>
                                        <description>RX FIFO is full</description>
                                        <value>0x5</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_FULL</name>
                                        <description>RX_FIFO &gt;= (MAX_FIFO_LEN -1)</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>LVL_ALMOST_EMPTY</name>
                                        <description>RX_FIFO &lt;= 1</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXTOSEL</name>
                            <description>UART Receive Interrupt Timeout Select. When receiving no start edge for an additional character within the set bittimes a RX interrupt is set even if the FIFO level is not reached. A value of 0 disables this function.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            </field>
                        <field>
                            <name>TXCLR</name>
                            <description>TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable FIFO clear</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable FIFO Clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>RXCLR</name>
                            <description>RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable FIFO clear</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable FIFO Clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC0_UART_IBRD</name>
                    <description>UART Integer Baud-Rate Divisor Register</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DIVINT</name>
                            <description>Integer Baud-Rate Divisor</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC0_UART_FBRD</name>
                    <description>UART Fractional Baud-Rate Divisor Register</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DIVFRAC</name>
                            <description>Fractional Baud-Rate Divisor</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>UC0_UART_TXDATA</name>
                    <description>UART Transmit Data Register</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data Transmitted or Received  Data that is to be transmitted via the UART is written to this field.  When read, this field contains the data that was received by the UART.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            </field>
                    </fields>
                </register>
